<a href="https://colab.research.google.com/github/ANGELA-NYUTU/DSC10-moringa-school-prep/blob/main/Data_Investigation_with_Pandas_II.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas II

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file

This dataset contains trips taken by thousands of kenyans to and from Nairobi during the year 2018.

*   Dataset link for download or access: [Link](https://drive.google.com/a/moringaschool.com/file/d/1xe2sHapdeGo7bIaiG7UV0rjgQZ5U6OXv/view?usp=sharing)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
x = '/content/bus_travels.csv'
df = pd.read_csv(x)
df

      ride_id travel_date travel_time  ... travel_to car_type max_capacity
0         247  2018-05-07       07:06  ...   Nairobi      Bus           49
1         256  2018-05-06       11:08  ...   Nairobi  shuttle           11
2         275  2018-05-04       05:00  ...   Nairobi  shuttle           11
3         285  2018-05-04       09:10  ...   Nairobi  shuttle           11
4         286  2018-05-04       09:20  ...   Nairobi  shuttle           11
...       ...         ...         ...  ...       ...      ...          ...
1106    15336  2018-05-07       07:01  ...   Nairobi      Bus           49
1107    15337  2018-05-07       07:08  ...   Nairobi      Bus           49
1108    15338  2018-05-07       07:04  ...   Nairobi      Bus           49
1109    15339  2018-05-07       07:05  ...   Nairobi      Bus           49
1110    15344  2018-05-09       08:00  ...   Nairobi      Bus           49

[1111 rows x 7 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

   ride_id travel_date travel_time travel_from travel_to car_type  max_capacity
0      247  2018-05-07       07:06       Kisii   Nairobi      Bus            49
1      256  2018-05-06       11:08       Kisii   Nairobi  shuttle            11
2      275  2018-05-04       05:00       Kisii   Nairobi  shuttle            11
3      285  2018-05-04       09:10       Kisii   Nairobi  shuttle            11
4      286  2018-05-04       09:20       Kisii   Nairobi  shuttle            11
5      287  2018-05-04       07:02       Kisii   Nairobi      Bus            49
6      288  2018-05-04       09:30       Kisii   Nairobi  shuttle            11
7      292  2018-05-04       19:03       Kisii   Nairobi      Bus            49
8      298  2018-05-04       09:00       Kisii   Nairobi  shuttle            11
9      302  2018-05-04       08:40       Kisii   Nairobi  shuttle            11

## 1.3 Accessing Information about our Dataset

In [ ]:
# Getting to know more about the dataset by accessing its information
#
OUR CODE GOES HERE

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# How many trips were taken on the 22/04/18?
# 
x = df[df['travel_date'] == '2018-04-22'].value_counts()
x_trips = x.sum()
x_trips

66

In [ ]:
# Challenge 2
# Which type of vehicle travelled on 23/04/18 from Kisii to Nairobi at 7.15am?
#
y = df[(df['travel_date'] == '2018-04-23') & (df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi') & (df['travel_time'] == '07:15')]
y

     ride_id travel_date travel_time  ... travel_to car_type max_capacity
497     5676  2018-04-23       07:15  ...   Nairobi  shuttle           11

[1 rows x 7 columns]

In [ ]:
# Challenge 3
# How many trips were made from Kisii to Nairobi?
# 
trips = df[(df['travel_from'] == 'Kisii') &(df['travel_to'] == 'Nairobi')].value_counts()
kisiitrip = trips.sum()
kisiitrip

545

In [ ]:
# Challenge 4
# How many trips were made by shuttle from Nairobi?
# 
nai = df[(df['travel_from'] == 'Nairobi') & (df['car_type'] == 'Shuttle')].value_counts()
nair = nai.sum()
nair

0

In [ ]:
# Challenge 5
# How many trips were made by bus from Nairobi to Awendo?
# 
awe = df[(df['travel_from'] == 'Nairobi') & (df['travel_to'] == 'Awendo') & (df['car_type'] == 'Bus')].value_counts()
bustrip = awe.sum()
bustrip

0

In [ ]:
# Challenge 6
# Which was the most travelled from destination by bus?
# 
tripbus = df[df['car_type'] == 'Bus']
tripbus1 = tripbus['travel_from'].value_counts()
tripbus1.head(1)

Rongo    115
Name: travel_from, dtype: int64

In [ ]:
# Challenge 7
# Which was the most travelled to destination?
# 
no_1_destination =df ['travel_to'].value_counts()
no_1_destination

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 8
# Which was the most travelled destination by bus?
tripbus2 = df[df['car_type'] == 'Bus']
tripbus3 = tripbus2['travel_to'].value_counts()
tripbus3.head(1)

Nairobi    599
Name: travel_to, dtype: int64

In [ ]:
# Challenge 9
# Which town did not have a departure by shuttle?
# 
tripshuttle = df[df['car_type'] == 'Shuttle'] 
tripshuttle1 = tripshuttle['travel_from']== 0
tripshuttle1

Series([], Name: travel_from, dtype: bool)

In [ ]:
# Challenge 10
# Which were the most 5 travelled to destinations?
# 
dfdest = df['travel_to'].value_counts()
dfdest
#df['travel_date'].groupby(df['travel_to']).value_counts()

Nairobi    1111
Name: travel_to, dtype: int64

In [ ]:
# Challenge 11
# Which were the least 5 travelled to destinations?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 12
# If all shuttles travelled with full capacity, how many people travelled in shuttles from Kisii to Nairobi in the month of May?
#
df7 = df[(df['car_type'] == 'Shuttle') & (df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi') & (df['travel_date'] > '2018-01-05' ) & (df['travel_date'] < '2018-30-05')]
df7['max_capacity'].sum()

0

In [ ]:
# Challenge 13
# Which date had the highest no. of trips in June?
#
df['travel_date']

In [ ]:
# Challenge 14
# On average, how many trips were made by all vehicles in a day?
df3 = df['travel_date'].value_counts()
df31 = df3.sum()/df3.count()
df31

61.72222222222222